Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_when_applying_for_carers_leave.html.txt.tmx
Source language: en
Languages: ga

source: Checklist when applying for carer's leave
ga: Seicliosta chun iarratas a dhéanamh ar shaoire cúramóra

source: There are various different procedures involved when you apply for carer’s leave and it is important to ensure that they are followed correctly
ga: Tá nósanna imeachta éagsúla ann chun iarratas a dhéanamh ar shaoire cúramóra agus tá sé tábhachtach go leanfaí i gceart iad

source: Qualifying for carer’s leave
ga: A bheith incháilithe do shaoire cúramóra

source: The qualifying requirements for carer’s leave are that:
ga: Seo a leanas na ceanglais incháilithe do shaoire cúramóra:

source: • You must have worked for your employer for a continuous period of 12 months and
ga: • Ní foláir nó go raibh tú ag obair do d’fhostóir ar feadh tréimhse leanúnaí 12 mhí agus

source: • The Department of Social Protection (DSP) must decide that the person you are proposing to care for is in need of full-time care and attention – see 2 below
ga: • Caithfidh an Roinn Coimirce Sóisialaí cinneadh a dhéanamh go bhfuil cúram agus aird lánaimseartha ag teastáil ón duine a bhfuil sé ar intinn agat aire a thabhairt dó nó di - féach 2 thíos

source: Applying to DSP for a decision that the person needs full-time care
ga: Iarratas a dhéanamh chuig RCS go ndéanfaí cinneadh go bhfuil cúram lánaimseartha ag teastáil ón duine

source: If the person you intend to care for is over 16, their GP must complete part of the application form for Carer's Benefit (pdf)
ga: Más rud é go bhfuil an duine a bhfuil sé ar intinn agat cúram a thabhairt dó nó di os cionn 16 bliana d’aois, caithfidh a d(h)ochtúir ginearálta cuid den Foirm iarratais do Shochar Cúramóra (pdf) a chomhlánú

source: This is not necessary if the person is under 16 and Domiciliary Care Allowance is being paid for them
ga: Ní gá é sin a dhéanamh i gcás duine atá faoi bhun 16 bliana d’aois a bhfuil Liúntas Cúram Baile á íoc ina leith

source: Your employer must also fill in part of this form giving your employment details
ga: Caithfidh d’fhostóir cuid den fhoirm seo a chomhlánú freisin agus sonraí faoi d’fhostaíocht a thabhairt

source: You should send the completed application form to DSP, who will decide whether or not this person requires full-time care and attention
ga: Ba chóir duit an fhoirm comhlánaithe a sheoladh chuig RCS, a dhéanfaidh cinneadh ansin cibé an bhfuil cúram agus aird lánaimseartha ag teastáil ón duine seo nó nach bhfuil

source: DSP will also check if you are eligible for Carer's Benefit
ga: Scrúdóidh RCS an scéal freisin ag féachaint an bhfuil tú incháilithe chun Sochar Cúramóra a fháil

source: Working out the amount of carer’s leave
ga: Conas an méid saoire cúramóra a áireamh

source: Under the Carer’s Leave Act 2001 you are entitled to at least 13 weeks’ carer’s leave up to a maximum of 104 weeks
ga: Tá tú i dteideal faoin Acht um Shaoire Cúramóra 2001 ar a laghad 13 sheachtain saoire cúramóra a bheith agat agus suas le 104 seachtain ar a mhéad

source: You can apply to take it in one continuous period or for a number of periods amounting to a total of 104 weeks
ga: Féadfaidh tú iarratas a dhéanamh í a ghlacadh in aon tréimhse leanúnach amháin nó i dtréimhsí éagsúla ar feadh 104 seachtain san iomlán

source: There must be a gap of at least 6 weeks between the periods of carer’s leave
ga: Ní mór spás 6 seachtaine ar a laghad a bheith idir na tréimhsí de shaoire cúramóra

source: If your employer agrees you can take a shorter period of leave
ga: Féadfaidh tú tréimhsí saoire níos lú a ghlacadh má cheadaíonn d’fhostóir é sin

source: However, your employer can refuse (on reasonable grounds) to allow you to take carer's leave of less than 13 weeks and must give you the reasons for the refusal in writing
ga: Féadfaidh d’fhostóir diúltú (ar chúiseanna réasúnta) cead a thabhairt duit saoire cúramóra a ghlacadh ar feadh tréimhsí níos lú ná 13 sheachtain agus caithfidh sé nó sí na fáthanna a thabhairt i scríbhinn duit

source: Giving notice to your employer
ga: Fógra a thabhairt do d’fhostóir

source: You must give your employer at least 6 weeks’ notice of your intention to take carer's leave
ga: Ní mór duit fógra 6 seachtaine ar a laghad a thabhairt do d’fhostóir go bhfuil sé ar intinn agat saoire cúramóra a ghlacadh

source: You should apply in writing saying when and how you intend to take carer’s leave, whether it will be in one block or separate periods
ga: Ba chóir duit iarratas a dhéanamh i scríbhinn ag insint cathain agus conas atá sé ar intinn agat saoire cúramóra a ghlacadh agus an nglacfaidh tú í in aon thréimhse amháin nó i dtréimhsí éagsúla

source: You should state that you have applied to DSP for a decision on the person for whom you propose to care
ga: Ba chóir duit a rá gur chuir tú iarratas isteach chuig RCS le go ndéanfaí cinneadh faoin duine a bhfuil sé ar intinn agat cúram a thabhairt dó nó dí

source: You can find a sample notice of intention form in Appendix A of the Carer's Leave Act explanatory booklet (pdf)
ga: Is féidir leat foirm fógra intinne a fháil sa bhfoscríbhinn A i leabhrán mínithe i dtaobh an Achta um Shaoire Cúramóra 2001 (pdf)

source: In emergency situations where it is not practicable to give 6 weeks' notice, you should give notice as soon as it is reasonably possible
ga: I gcás éigeandála nuair nach mbeadh sé praiticiúil fógra 6 seachtaine a thabhairt ba chóir duit fógra a thabhairt a luaithe agus a bheadh sé réasúnta é sin a dhéanamh

source: Confirmation of carer’s leave
ga: Dearbhú maidir le saoire cúramóra

source: If your application for carer’s leave is successful, you and your employer must sign a document confirming this arrangement, at least 2 weeks before you start carer’s leave
ga: Má éiríonn le d’iarratas ar shaoire cúramóra caithfidh tú féin agus d’fhostóir doiciméad a shíniú ag dearbhú an tsocraithe sin coicís ar a laghad sula dtosaíonn tú do shaoire cúramóra

source: The document should state the start date, the duration of your carer’s leave and specify how your leave will be taken
ga: Ba chóir a thabhairt le fios sa doiciméad sin dáta tosaithe do shaoire agus conas a ghlacfaidh tú í

source: You can find a sample confirmation document in Appendix B of the Carer's Leave Act explanatory booklet (pdf)
ga: Is féidir leat doiciméad dearbhaithe shampla a fháil sa bhfoscríbhinn B i leabhrán mínithe i dtaobh an Achta um Shaoire Cúramóra 2001 (pdf)

source: Your employer keeps the signed document and gives you a copy of it
ga: Coinneoidh d’fhostóir an doiciméad sínithe sin agus tabharfaidh sé nó sí cóip duit

source: This document is flexible, which means that your arrangement to take carer's leave can be amended
ga: Doiciméad inathraithe a bheidh ann sa mhéid is go bhféadfaidh tú leasú a dhéanamh ar na socruithe maidir le saoire cúramóra a ghlacadh

source: Even if you have already started carer’s leave, your carer’s leave (or part of it) may be postponed or varied as to how it is taken, provided that you and your employer agree
ga: Fiú má tá tús curtha agat cheana féin le do shaoire cúramóra (nó le cuid di) féadfaidh tú do shaoire a chur siar, nó athrú a dhéanamh ar conas a ghlacfaidh tú í, ach tú féin agus d’fhostóir a bheith ar aon intinn faoin scéal

source: You should both amend and sign the confirmation of carer’s leave agreement
ga: Ba chóir don bheirt agaibh araon an dearbhú maidir le saoire cúramóra a leasú agus a shíniú

source: Again, your employer should keep the amended agreement and give you a copy of it
ga: Ba chóir do d’fhostóir an comhaontú leasaithe a choinneáil agus cóip de a thabhairt duitse

source: Income while on carer’s leave
ga: Ioncam fad is atá tú ar shaoire cúramóra

source: You are not paid while you are on carer’s leave
ga: Ní íoctar tú fad is atá tú ar shaoire cúramóra

source: You may be eligible for Carer’s Benefit if you have enough PRSI contributions
ga: Féadfar go mbeidh tú incháilithe Sochar Cúramóra a fháil má tá dóthain ranníocaíochtaí ÁSPC agat

source: If you do not qualify for Carer's Benefit you may qualify for Carer's Allowance, which is a means-tested payment
ga: Mura bhfuil tú cáilithe chun Sochar Cúramóra a fháil d’fhéadfá a bheith i dteideal Liúntas Cúramóra a fháil

source: You may do paid or voluntary work or attend a course while on carer’s leave for up to 15 hours a week, subject to a weekly income limit set by DSP
ga: Féadfaidh tú 15 uaire in aghaidh na seachtaine a chaitheamh ag obair ar phá faoi réir ag teorainn ioncaim a cheapfaidh RCS, nó dul i mbun oibre deonaí, nó féadfaidh tú freastal ar chúrsa fad is atá tú ar shaoire cúramóra

source: Maintaining your PRSI contributions while on carer’s leave
ga: Do ranníocaíochtaí ÁSPC a choinneáil fad is atá tú ar shaoire cúramóra

source: If you are getting Carer's Benefit you will get credited social insurance contributions, known as credits
ga: Más rud é go bhfuil Sochar Cúramóra á fháil agat gheobhaidh tú ranníocaíochtaí árachais shóisialta chun sochair

source: If you are on carer's leave but do not get Carer's Benefit, you are still entitled to get credits
ga: Creidmheasanna a thugtar orthu. Más rud é go bhfuil tú ar shaoirecúramóra ach nach bhfuil Sochar Cúramóra á fháil agat, tá tú fós i dteideal creidmheasanna a fháil

source: You should get your employer to complete the application form for carer's leave credits (pdf)
ga: Ba chóir duit iarraidh ar d’fhostóir an Foirm iarratais do Shochar Cúramóra (pdf) a chomhlánú

source: Four weeks before the date you will return to work, you must give written notice to your employer that you intend to return to work
ga: Caithfidh tú fógra i scríbhinn a thabhairt do d’fhostóir ceithre seachtaine roimh an dáta a bhfuil sé ar intinn agat filleadh ar obair

source: As regards your employment conditions, generally you are treated as if you had been in work during your period of carer’s leave except that you are not entitled to pay
ga: Maidir le do dhálaí fostaíochta, déileáiltear leat de ghnáth amhail is dá mbeifeá ag obair le linn do thréimhse saoire cúramóra, ach amháin nach mbeadh tú i dteideal pá a fháil

source: You are entitled to annual leave and public holidays only for the first 13 weeks of carer’s leave
ga: Beidh tú i dteideal saoire bhliantúil agus saoirí poiblí a fháil i gcomhair an chéad 13 sheachtain de do shaoire cúramóra

source: You are protected against being victimised for taking carer's leave or for proposing to take it
ga: Tugtar cosaint duit i gcoinne a bheith íospartha de bharr saoire cúramóra a ghlacadh nó toisc gur bheartaigh tú í a ghlacadh

source: You can find out more in our document on carer’s leave
ga: Is féidir leat tuilleadh a fháil amach inár ndoiciméad faoi saoire cúramóra

source: You can contact Workplace Relations Commission's Information and Customer Service for information about carer’s leave
ga: Féadfaidh tú teagmháil a dhéanamh leis an tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre chun faisnéis a fháil faoi shaoire cúramóra

source: For information about Carer's Benefit, contact your local social welfare office or Intreo centre
ga: Téigh i dteagmháil leis an oifig leasa shóisialaigh áitiúil nó ionad Intreo chun faisnéis a fháil faoi Shochar Cúramóra
